let tbl_posts = [

    {
    
    id:500 ,
    title:'제주도',
    content:'한국·중국·일본 등 극동 지역의 중앙부에 있어 지정학적으로도 중요하며, 도 전체가 바다로 둘러싸였다. 서귀포시 대정읍 마라도다. 한국 최남단에 있는 도로서, 제주도를 포함해 9개의 유인도와 55개의 무인도로 이루어졌다. 이 가운데 유인도는 우도·상추자도·하추자도·비양도·횡간도·추포도·가파도·마라도이다. 남북 간의 거리가 약 31㎞, 동서간의 거리가 약 73㎞로 동서로 가로놓인 모양이다. 러시아·중국 등의 대륙과 일본·동남아 등지를 연결하는 요충지이며, 천혜의 자연경관이 수려한 세계적인 휴양관광지다**.**',
    writerId:'orange@naver.com',
    createdAt:'2023-07-28 15:31',
    updatedAt:'2023-07-28 15:51',
    like:3
    
    },
    
    {
    
    id:501 ,
    title:'가짜식욕',
    content:'배가 고픈 것이 아닌데도 무언가를 먹고 싶은 욕구가 드는 심리적 허기를 이르는 말로, 배고프지 않아야 할 상태임에도 배고픔을 느끼는 것을 가리킨다. 이는 영양 부족이나 과도한 피로, 수면 부족, 스트레스 등 다양한 원인으로 발생한다.',
    writerId:'wowwow@naver.com',
    createdAt:'2023-07-28 15:31',
    updatedAt:'2023-07-28 15:51',
    like:3
    
    },
    
    {
    
    id:502 ,
    title:'킹더랜드 보시는 분?',
    content:'아 이준호랑 사귈까',
    writerId:'100soo@naver.com',
    createdAt:'2023-07-28 15:31',
    updatedAt:'2023-07-28 15:51',
    like:3
    
    },
    {
        id:1, 
        title:'저체온치료',
        content:'더운 여름철에 환기가 잘 되지 않는 밀폐된 공간에서 냉방이 지속될 경우 가벼운 감기, 몸살, 권태감 같은 증상이 나타나는 것을 말한다. 다시 말해 냉방병이란 어떤 질병을 가리키는 용어라기보다는 유사한 증상을 나타내는 여러 질환군을 총칭하는 증후군의 일종이라고 말할 수 있다.',
        writerId:'abc123@naver.com',
        createdAt:'2023-07-11 15:31',
        updatedAt:'2023-07-28 15:51', 
        like:3
      },
      {
        id:2, 
        title:'인생이란..',
        content:'참..눈물만 납니다..ㅠ',
        writerId:'test@naver.com',
        createdAt:'2023-07-15 15:31',
        updatedAt:'2023-07-30 15:51', 
        like:5
      },
      {
        id:3, 
        title:'심근경색증',
        content:'저체온증은 임상적으로 중심체온(심부체온)이 35℃ 이하로 떨어진 상태를 말한다. 인체의 열 생산이 감소되거나 열 소실이 증가될 때, 또는 두 가지가 복합적으로 발생할 때 초래되며, 저체온증은 갑자기 생기거나 점차적으로 발생할 수 있다. 체온이 정상보다 낮아지면 혈액 순환과 호흡, 신경계의 기능이 느려진다.',
        writerId:'test@naver.com',
        createdAt:'2023-07-17 15:31',
        updatedAt:'2023-07-05 15:51', 
        like:7
      },
      {
        id:4, 
        title:'워맨스',
        content:'더운 여름철에 환기가 잘 되지 않는 밀폐된 공간에서 냉방이 지속될 경우 가벼운 감기, 몸살, 권태감 같은 증상이 나타나는 것을 말한다. 다시 말해 냉방병이란 어떤 질병을 가리키는 용어라기보다는 유사한 증상을 나타내는 여러 질환군을 총칭하는 증후군의 일종이라고 말할 수 있다.',
        writerId:'abc123@naver.com',
        createdAt:'2023-07-16 15:31',
        updatedAt:'2023-07-28 15:51', 
        like:3
      },
      {
        id:5, 
        title:'당기순이익',
        content:'과도한 고온 환경에 노출되거나, 더운 환경에서 작업, 운동 등을 시행하면서 신체의 열 발산이 원활히 이루어지지 않아 고체온 상태가 되면서 발생하는 신체 이상을 말한다. 고전적인 열사병의 정의는 40℃ 이상의 심부체온, 중추신경계 기능 이상, 무한증(땀이 나지 않는 것)의 세 가지를 모두 가지고 있어야 하지만, 무한증은 나타나지 않을 수도 있다. 고체온증과 중추신경계 기능 이상을 보이는 환자는 열사병을 반드시 의심해야 하는데, 여러 장기를 손상시키는 응급 상황이므로 즉각적으로 처치하지 못하면 매우 높은 사망률을 보인다.',
        writerId:'test@naver.com',
        createdAt:'2023-07-15 15:31',
        updatedAt:'2023-07-30 15:51', 
        like:5
      },
      {
        id:6, 
        title:'파킨슨 법칙',
        content:'저체온증은 임상적으로 중심체온(심부체온)이 35℃ 이하로 떨어진 상태를 말한다. 인체의 열 생산이 감소되거나 열 소실이 증가될 때, 또는 두 가지가 복합적으로 발생할 때 초래되며, 저체온증은 갑자기 생기거나 점차적으로 발생할 수 있다. 체온이 정상보다 낮아지면 혈액 순환과 호흡, 신경계의 기능이 느려진다.',
        writerId:'test@naver.com',
        createdAt:'2023-07-05 15:31',
        updatedAt:'2023-07-05 15:51', 
        like:3
      },
      {
        id:7, 
        title:'네이버',
        content:'더운 여름철에 환기가 잘 되지 않는 밀폐된 공간에서 냉방이 지속될 경우 가벼운 감기, 몸살, 권태감 같은 증상이 나타나는 것을 말한다. 다시 말해 냉방병이란 어떤 질병을 가리키는 용어라기보다는 유사한 증상을 나타내는 여러 질환군을 총칭하는 증후군의 일종이라고 말할 수 있다.',
        writerId:'abc123@naver.com',
        createdAt:'2023-07-08 15:31',
        updatedAt:'2023-07-28 15:51', 
        like:3
      },
      {
        id:8, 
        title:'다음',
        content:'과도한 고온 환경에 노출되거나, 더운 환경에서 작업, 운동 등을 시행하면서 신체의 열 발산이 원활히 이루어지지 않아 고체온 상태가 되면서 발생하는 신체 이상을 말한다. 고전적인 열사병의 정의는 40℃ 이상의 심부체온, 중추신경계 기능 이상, 무한증(땀이 나지 않는 것)의 세 가지를 모두 가지고 있어야 하지만, 무한증은 나타나지 않을 수도 있다. 고체온증과 중추신경계 기능 이상을 보이는 환자는 열사병을 반드시 의심해야 하는데, 여러 장기를 손상시키는 응급 상황이므로 즉각적으로 처치하지 못하면 매우 높은 사망률을 보인다.',
        writerId:'test@naver.com',
        createdAt:'2023-07-06 15:31',
        updatedAt:'2023-07-30 15:51', 
        like:5
      },
      {
        id:9, 
        title:'구글',
        content:'저체온증은 임상적으로 중심체온(심부체온)이 35℃ 이하로 떨어진 상태를 말한다. 인체의 열 생산이 감소되거나 열 소실이 증가될 때, 또는 두 가지가 복합적으로 발생할 때 초래되며, 저체온증은 갑자기 생기거나 점차적으로 발생할 수 있다. 체온이 정상보다 낮아지면 혈액 순환과 호흡, 신경계의 기능이 느려진다.',
        writerId:'test@naver.com',
        createdAt:'2023-07-01 15:31',
        updatedAt:'2023-07-05 15:51', 
        like:3
      },
      {
        id:10, 
        title:'삼성',
        content:'더운 여름철에 환기가 잘 되지 않는 밀폐된 공간에서 냉방이 지속될 경우 가벼운 감기, 몸살, 권태감 같은 증상이 나타나는 것을 말한다. 다시 말해 냉방병이란 어떤 질병을 가리키는 용어라기보다는 유사한 증상을 나타내는 여러 질환군을 총칭하는 증후군의 일종이라고 말할 수 있다.',
        writerId:'abc123@naver.com',
        createdAt:'2023-07-02 15:31',
        updatedAt:'2023-07-28 15:51', 
        like:3
      },
      {
        id:11, 
        title:'카카오',
        content:'과도한 고온 환경에 노출되거나, 더운 환경에서 작업, 운동 등을 시행하면서 신체의 열 발산이 원활히 이루어지지 않아 고체온 상태가 되면서 발생하는 신체 이상을 말한다. 고전적인 열사병의 정의는 40℃ 이상의 심부체온, 중추신경계 기능 이상, 무한증(땀이 나지 않는 것)의 세 가지를 모두 가지고 있어야 하지만, 무한증은 나타나지 않을 수도 있다. 고체온증과 중추신경계 기능 이상을 보이는 환자는 열사병을 반드시 의심해야 하는데, 여러 장기를 손상시키는 응급 상황이므로 즉각적으로 처치하지 못하면 매우 높은 사망률을 보인다.',
        writerId:'test@naver.com',
        createdAt:'2023-07-05 15:31',
        updatedAt:'2023-07-30 15:51', 
        like:5
      },
      {
        id:12, 
        title:'소주vs맥주',
        content:'소주.',
        writerId:'test@naver.com',
        createdAt:'2023-07-06 15:31',
        updatedAt:'2023-07-07 15:51', 
        like:3
      },
    
    
    ]

    //게시글 여러개를(목록) 가져오는 함수 (API 백엔드 개발자가 만드는 함수)
    //page : 보고자 하는 페이지
    //limit : 한 페이지당 게시물 갯수
    //ordby : 'like' 좋아요 내림차순정렬 , 'date': 작성일 내림차순(최신순),'dateAsc': 작성일 오름차순 (오래된순)
    function fetchPosts(page, limit, ordby,){
    //tbl_posts는 15개의 객체가 들어있는 배열  
    if(ordby === 'like'){//좋아요 수 정렬
       tbl_posts.sort((a,b)=>b.like - a.like);
        
    }else if(ordby === 'dateAsc'){//오래된 순 정렬
        tbl_posts.sort((a,b)=>new Date(a.createdAt) - new Date(b.createdAt));
        
    }else(ordby === 'date'){//최신순 정렬
        
        tbl_posts.sort((a,b)=>new Date(b.createdAt) - new Date(a.createdAt));


    }
    }